apps/backend/perf/test-management-perf.yml
config:
  target: "http://localhost:5000"  # adjust if your backend runs on a different port
  phases:
    # Light warm-up
    - duration: 60
      arrivalRate: 3
      name: "Warm up (light load)"
    # Ramp up to expected normal traffic
    - duration: 90
      arrivalRate: 6
      rampTo: 15
      name: "Ramp up to expected load"
    # Sustained expected peak load
    - duration: 60
      arrivalRate: 15
      name: "Sustained peak load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # Simulates staff browsing test types for configuration and management
  - name: "Browse test types"
    flow:
      - get:
          url: "/api/test-types"
      - get:
          url: "/api/test-types/method/form"
      - get:
          url: "/api/test-types/method/upload"

  # Simulates patients or staff viewing the available labs
  - name: "Browse labs list"
    flow:
      - get:
          url: "/api/labs"

  # Simple health-check / baseline endpoint under load
  - name: "API health check"
    flow:
      - get:
          url: "/api/health"